#####################################################################################################################
################################################## Test data: #######################################################
#####################################################################################################################
#Петрова Ольга 25 18 16
#Калиниченко Иван 14 19 15
#Иванов Сергей 11 11 11
#Симонов Семён 5 5 5
#Борисов Андрей 25 18 16
#####################################################################################################################
##################################################### Data: #########################################################
#####################################################################################################################
class CPupil:
    surname = None
    name = None
    points = {}

    def __init__(self, surname, name, points):
        self.surname = surname
        self.name = name
        self.points = points

    def get_points_sum(self):
        return sum(self.points)

    def show_info(self):
        print("%s %s" % (self.surname, self.name))
#####################################################################################################################
##################################################### Funcs: ########################################################
#####################################################################################################################
def main():
    pupils_count = int(input("Количество учащихся: "))
    if pupils_count > 250:
        print("Учеников больше 250!")
        exit(1)
    
    pupils_list = list()
    max_point = 0

    print("Введите имена учеников:")
    pupil_index = 0
    while pupil_index < pupils_count:
        full_name = input()
        points = [None] * 3

        # Обработка данных участника.
        surname, name, points[0], points[1], points[2] = full_name.split(" ")
        points = list(map(int, points))

        if max(points) > 25:
            print("Ошибка в количестве баллов!")
            print("Повторите попытку ввода.")
            continue
       
        if len(surname) > 20:
            print("Фамилия слишком длинная!")
            print("Повторите попытку ввода.")
            continue

        if len(name) > 15:
            print("Имя слишком длинное!")
            print("Повторите попытку ввода.")
            continue
        
        # Инициализация объектов класса учаник.
        pupil = CPupil(surname, name, points)
        pupil_points_sum = pupil.get_points_sum()
        
        # Сравнение суммы балов ученика, с последним наивысшим баллом.
        if max_point < pupil_points_sum:
            max_point = pupil_points_sum

        # Добавление в общий список учеников.
        pupils_list.append(pupil)
        pupil_index += 1

    # Поиск всех учеников с наивысшим баллом.
    pupils_favorites = list()
    for pupil in pupils_list:
        pupil_points_sum = pupil.get_points_sum()
        if max_point == pupil_points_sum:
            pupils_favorites.append(pupil)

    # Вывод призёров.
    print("Фавориты:")
    for pupil in pupils_favorites:
        pupil.show_info()
#####################################################################################################################
##################################################### Exec: #########################################################
#####################################################################################################################
main()